In [1]:
#import libraries for Python

In [2]:
import os
import json
import numpy
import datetime
import pandas as pd
import json

import pymongo
from sqlalchemy import create_engine

In [3]:
#connect to MySQL and #connect to mongoDB

In [23]:
#connect mongodb
mysql_uid = "root"
mysql_pwd = "data0531"

atlas_cluster_name = "ds2002clustermdb.wo6hwxd"
atlas_user_name = "user"
atlas_password = "0531Data"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila"
dst_dbname = "sakila_project"

#connect MySQL connection variables
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"

user_id = "root"
pwd = "data0531"
db_name = src_dbname;

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://user:0531Data@ds2002clustermdb.wo6hwxd.mongodb.net

In [5]:
#import methods for pandas dataframes to use with mySQL and MongoDB

In [6]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [7]:
#create MySQL database

In [8]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

In [9]:
#create dim tables

In [10]:
#dim rental

In [11]:
sql_rental = "SELECT * FROM sakila.rental;"
df_rental = get_sql_dataframe(user_id, pwd, src_dbname, sql_rental)

df_rental.drop('last_update', axis=1, inplace=True)

df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1

In [12]:
#dim payment

In [13]:
sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_sql_dataframe(user_id, pwd, src_dbname, sql_inventory)

df_inventory.drop('last_update', axis=1, inplace=True)

df_inventory.head(2)

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1

In [14]:
#dim payment

In [15]:
sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_sql_dataframe(user_id, pwd, src_dbname, sql_payment)

df_payment.drop('last_update', axis=1, inplace=True)
df_payment.drop('customer_id', axis=1, inplace=True)
df_payment.drop('staff_id', axis=1, inplace=True)

df_payment.head(2)

   payment_id  rental_id  amount        payment_date
0           1         76    2.99 2005-05-25 11:30:37
1           2        573    0.99 2005-05-28 10:35:23

In [16]:
#dim film from JSON file

In [18]:
#Normal .head() was not displaying the table and I thought df_payment did not have data in it. But it did...
#That took so long to figure out how to fix

In [19]:
df_film = pd.read_json("sakila_film.json");

df_film.drop('last_update', axis=1, inplace=True)
df_film.drop('language_id', axis=1, inplace=True)
df_film.drop('original_language_id', axis=1, inplace=True)
df_film.drop('length', axis=1, inplace=True)
df_film.drop('special_features', axis=1, inplace=True)
df_film.drop('description', axis=1, inplace=True)

display(df_film.head(2));

,film_id,title,release_year,rental_duration,rental_rate,replacement_cost,rating
0,1,ACADEMY DINOSAUR,2006,6,0.99,20.99,PG
1,2,ACE GOLDFINGER,2006,3,4.99,12.99,G

In [24]:
#dim customer from MongoDB
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"customer" : 'sakila_customer.json'}

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        print(f"{file} was successfully loaded.")

        
client.close()

Collection(Database(MongoClient(host=['ac-ckb2too-shard-00-01.wo6hwxd.mongodb.net:27017', 'ac-ckb2too-shard-00-02.wo6hwxd.mongodb.net:27017', 'ac-ckb2too-shard-00-00.wo6hwxd.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, authsource='admin', replicaset='atlas-2yu43d-shard-0', tls=True), 'sakila'), 'customer') was successfully loaded.

In [25]:
#Get data from MongoDB and put into a dataframe

In [26]:
query = {}
collection = "customer"

df_customer = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)

df_customer.drop('last_update', axis=1, inplace=True)
df_customer.drop('store_id', axis=1, inplace=True)
df_customer.drop('create_date', axis=1, inplace=True)
df_customer.drop('email', axis=1, inplace=True)
df_customer.drop('address_id', axis=1, inplace=True)

df_customer.head(2)

   customer_id first_name last_name  active
0            1       MARY     SMITH       1
1            2   PATRICIA   JOHNSON       1

In [28]:
#create fact table (query from MySQL workbench into dataframe)

In [29]:
#join inventory and film
df_enriched_inventory = pd.merge(df_inventory, df_film, left_on='film_id', right_on='film_id', how='right')

df_enriched_inventory.head(2)

,inventory_id,film_id,store_id,title,release_year,rental_duration,rental_rate,replacement_cost,rating
0,1.0,1,1.0,ACADEMY DINOSAUR,2006,6,0.99,20.99,PG
1,2.0,1,1.0,ACADEMY DINOSAUR,2006,6,0.99,20.99,PG

In [30]:
#load df_rental with df_enriched_inventory, df_payment, df_customer to make fact_rental
df_rental_stage1 = pd.merge(df_rental, df_enriched_inventory,left_on='inventory_id', right_on='inventory_id', how='right')
#display(df_rental_stage1.head(2));
df_rental_stage2 = pd.merge(df_rental_stage1, df_payment, left_on='rental_id', right_on='rental_id', how='inner')
#display(df_rental_stage2.head(2));
df_rental_stage3 = pd.merge(df_rental_stage2, df_customer,left_on='customer_id', right_on='customer_id', how='left' )

df_rental_stage3.sort_values(by=['rental_id'], inplace=True)
display(df_rental_stage3.head(2));

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,film_id,store_id,title,release_year,rental_duration,rental_rate,replacement_cost,rating,payment_id,amount,payment_date,first_name,last_name,active
1277,1.0,2005-05-24 22:53:30,367.0,130.0,2005-05-26 22:04:30,1.0,80,1.0,BLANKET BEVERLY,2006,7,2.99,21.99,G,3504,2.99,2005-05-24 22:53:30,CHARLOTTE,HUNTER,1
5340,2.0,2005-05-24 22:54:33,1525.0,459.0,2005-05-28 19:40:33,1.0,333,2.0,FREAKY POCUS,2006,7,2.99,16.99,R,12377,2.99,2005-05-24 22:54:33,TOMMY,COLLAZO,1

In [31]:
df_fact_rental = df_rental_stage3
df_fact_rental['fact_key'] = range(0, len(df_fact_rental))

df_fact_rental = df_fact_rental[['fact_key', 'rental_id', 'inventory_id', 'film_id', 'staff_id', 'store_id', 
                                 'customer_id', 'payment_id', 'rental_date', 'return_date', 'payment_date',
                                 'amount', 'first_name', 'last_name', 'active', 'title', 'rating','release_year', 
                                 'rental_duration', 'replacement_cost']]
display(df_fact_rental.head(2))

,fact_key,rental_id,inventory_id,film_id,staff_id,store_id,customer_id,payment_id,rental_date,return_date,payment_date,amount,first_name,last_name,active,title,rating,release_year,rental_duration,replacement_cost
1277,0,1.0,367.0,80,1.0,1.0,130.0,3504,2005-05-24 22:53:30,2005-05-26 22:04:30,2005-05-24 22:53:30,2.99,CHARLOTTE,HUNTER,1,BLANKET BEVERLY,G,2006,7,21.99
5340,1,2.0,1525.0,333,1.0,2.0,459.0,12377,2005-05-24 22:54:33,2005-05-28 19:40:33,2005-05-24 22:54:33,2.99,TOMMY,COLLAZO,1,FREAKY POCUS,R,2006,7,16.99

In [32]:
#load dim and fact tables into MySQL

In [33]:
db_operation = "insert"

set_dataframe(user_id, pwd, dst_dbname, df_rental, 'dim_rental', 'rental_id', db_operation)

set_dataframe(user_id, pwd, dst_dbname, df_inventory, 'dim_inventory', 'inventory_id', db_operation)

set_dataframe(user_id, pwd, dst_dbname, df_payment, 'dim_payment', 'payment_id', db_operation)

set_dataframe(user_id, pwd, dst_dbname, df_film, 'dim_film', 'film_id', db_operation)

set_dataframe(user_id, pwd, dst_dbname, df_customer, 'dim_customer', 'customer_id', db_operation)

set_dataframe(user_id, pwd, dst_dbname, df_fact_rental, 'fact_rental', 'fact_key', db_operation)

In [ ]:
#Next: create dim date - done via SQL file. (run in mySQLWorkbench) (See Documentation)

In [ ]:
#Next: run SQl query in MySQL Workbench (See Documentation)